Tekla.Structures.Model.Operations.Operation.Open(System.String)
Opens a new model to Tekla Structures ignoring auto saved information.
ModelFolder: The model folder to be used.
Returns: True on success.
The following example opens the model that is in the C:\teklastructuresmodels\NewModel17 folder
and shows a message if the opening was successful.
using Tekla.Structures.Model.Operations;
using System.Windows.Forms;
public class Example
{
public void Example1()
{
if (Operation.Open("C:\\teklastructuresmodels\\NewModel17"))
MessageBox.Show("The model opened successfully.");
}
}